{
  "type": "economy",
  "paragraphs": [
    {
      "id": 1,
      "title": "Introduction to Business Model",
      "textCondensed": "In this scenario, the firm collects data from the user but without any linkage to email addresses or user names. Further, the data will not be sold to third parties but will provide opportunities for internal improvements. Like this, consumers are not afraid of losing their private healthcare data to any third party. Further, they can benefit from app improvements made based on the internal processing of data. In return for not selling the data, the company could charge consumers a one-time download fee.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [1],
      "highlightIT": [1],
      "highlightEconomy": [1],
      "highlightApp": []
    },
    {
      "id": 2,
      "title": "Advantages from the Firm's Perspective",
      "textCondensed": "For the firm, the following advantages arise from this model. The collected data helps the firm to improve its AI model, its services and marketing capabilities. As far as users are concerned, it is much easier for the company to establish consumer loyalty, while no user is deterred due to data protection concerns. There is no risk of reputational loss due to misuse of data since the collected data is not directly linked to individuals' identification details. As no data are sold, competitors cannot benefit from the knowledge gained from them either.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [4],
      "highlightIT": [],
      "highlightEconomy": [2],
      "highlightApp": []
    },
    {
      "id": 3,
      "title": "Disadvantages from the Firm's Perspective",
      "textCondensed": "For the firm, the following disadvantages arise from this model. Firstly, non-personalized data cannot be used for applying methods of price or service discrimination. The firm risks data breaches and liability issues. Therefore, the firm has to invest in data protection and should be informed about GDPR regulations. Furthermore, users' switching costs to other apps cannot be increased by personalising the content presented. In addition, data cannot be used for external purposes like selling or renting data, working together with third parties to place the targeted advertisement. All these aspects lead to competitive disadvantages compared to companies that collect and sell personalized data.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [4],
      "highlightIT": [],
      "highlightEconomy": [3],
      "highlightApp": []
    },
    {
      "id": 4,
      "title": "Advantages from the User's Perspective",
      "textCondensed": "For the user, the following advantages arise from this model. Most importantly, users will not feel concerned about the loss of privacy. There is no unwanted perception of observation and the users do not lose control over sensitive data. There will not be given any bargaining power to third parties. Further, the consumers will have only few information costs in terms of privacy protection and no sign-up costs when entering the app. Personal costs due to data breaches will not arise.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [5],
      "highlightIT": [3],
      "highlightEconomy": [4],
      "highlightApp": []
    },
    {
      "id": 5,
      "title": "Disadvantages from the User's Perspective",
      "textCondensed": "For the user, the following disadvantages arise from this model. With no personalized data being collected, users can neither profit from the targeted advertisement which reduces searching costs nor from possible discounts (e.g. on insurance fees). Further, they cannot benefit from personalised content and statistics. Since the firm can only derive minor profits from the user's data, customers will have to pay a fee in order to access the app.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [5],
      "highlightIT": [3],
      "highlightEconomy": [5],
      "highlightApp": []
    }
  ,
    {
      "id": 6,
      "title": "The Social Perspective",
      "textCondensed": "Since non-personalized data is collected, socially beneficial predictions can be made by the company. Especially in the healthcare sector, these predictions can be very valuable for governments and healthcare institutions. Furthermore, the data collected cannot be used to make individually differentiated predictions about non-users. This is known as 'negative privacy externalities' and would affect uninvolved third parties negatively. These externalities can be prevented by this model.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [],
      "highlightIT": [],
      "highlightEconomy": [],
      "highlightApp": []
    }
  ],
  "references": [
    {
      "link": "http://google.ch",
      "name": "Link1"
    },
    {
      "link": "http://google.ch",
      "name": "Link2"
    }
  ]
}
