{
  "type": "economy",
  "paragraphs": [
    {
      "id": 1,
      "title": "Introduction to Business Model",
      "textCondensed": "In this scenario, we will collect directly identifiable data. Like this, it is able to personalize the content of the app and improve the services to the benefit of the user. However, the data is not sold, which excludes competitors from insights gained by processing the data. In return for not selling the data, our company could charge consumers a one-time download or a recurring subscription fee. Since users can register, the data could also be used by the users themselves to pay lower health insurance fees.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [1],
      "highlightIT": [1],
      "highlightEconomy": [1],
      "highlightApp": []
    },
    {
      "id": 2,
      "title": "Advantages from the Firm's Perspective",
      "textCondensed": "For our firm, the following advantages arise from this model. The collected data helps the firm to improve its AI model, its services and marketing capabilities. Further, the directly identifiable data can be used for targeted advertising or applying methods of price or service discrimination. Users' switching costs to other apps can be increased by personalising the content presented. Like this, consumer loyalty is easier to establish. As no data are sold, competitors cannot benefit from the knowledge gained from them either.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [4],
      "highlightIT": [],
      "highlightEconomy": [2],
      "highlightApp": []
    },
    {
      "id": 3,
      "title": "Disadvantages from the Firm's Perspective",
      "textCondensed": "For our firm, the following disadvantages arise from this model. The firm risks data breaches and liability issues. Therefore, our firm has to invest in data protection and should be informed about GDPR regulations. In addition, data cannot be used for external purposes like selling or renting data. As far as users are concerned, they might be deterred by the fact that the firm collects all their directly identifiable healthcare data. There is a risk of reputational and stock market loss due to misuse of data or data breaches. This will lead to additional costs for consumer relationship management. In addition, our company risks collecting 'false' data when users willfully give incorrect answers.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [4],
      "highlightIT": [],
      "highlightEconomy": [3],
      "highlightApp": []
    },
    {
      "id": 4,
      "title": "Advantages from the User's Perspective",
      "textCondensed": "For the user, the following advantages arise from this model. Since no data is sold, there will not be given any bargaining power to third parties. With directly identifiable data being collected, users can profit from the targeted advertisement which reduces searching costs and from possible discounts (e.g. on insurance fees). Further, they can benefit from personalised content and statistics. In return for their more detailed data, users can use the app at a lower price.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [5],
      "highlightIT": [3],
      "highlightEconomy": [4],
      "highlightApp": []
    },
    {
      "id": 5,
      "title": "Disadvantages from the User's Perspective",
      "textCondensed": "For the user, the following disadvantages arise from this model. Most importantly, users will feel concerned about the loss of privacy. There is an unwanted perception of observation and the users might perceive a loss of control over their sensitive data. Further, consumers will have information costs in terms of privacy protection and sign-up costs when entering the app. Personal costs due to data breaches might arise. Further, as a target of price and service differentiation, they could sacrifice higher costs. ",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [5],
      "highlightIT": [3],
      "highlightEconomy": [5],
      "highlightApp": []
    }
  ,
    {
      "id": 6,
      "title": "The Social Perspective",
      "textCondensed": "Since directly identifiable data is collected, socially beneficial predictions can be made by our company in detail. Especially in the healthcare sector, these predictions can be very valuable for governments and healthcare institutions. Furthermore, the collected data can only be used within our company to make individually differentiated predictions about non-users. This is known as 'negative privacy externalities' and affects uninvolved third parties negatively. These externalities can be limited by this model to the scope of the company.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [],
      "highlightIT": [],
      "highlightEconomy": [],
      "highlightApp": []
    }
  ],
   "references": [
     {
       "link": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1017.7187&rep=rep1&type=pdf",
       "name": "Economics of Personal Data and Privacy"
     },
     {
       "link": "https://www.sciencedirect.com/science/article/pii/S0047272719300131",
       "name": "Information Externalities"
     },
     {
       "link": "https://www.jstor.org/stable/pdf/23015787.pdf?refreqid=excelsior%3Ad0b7395ff7fd835c563e4bbb8f148842",
       "name": "Internet Users' Information Privacy Concerns (IUIPC)"
     },
     {
       "link": "https://link.springer.com/content/pdf/10.1007%2F3-540-45017-3_46.pdf",
       "name": "Data Exchange: Industry vs. Consumer"
     },
     {
       "link": "https://www.jstor.org/stable/pdf/23015560.pdf?refreqid=excelsior%3Aba9bb5dcd72d3da94f2f41fd9bf81aa7",
       "name": "Effect of Online Privacy Information on Online Purchasing Behavior"
     }
  ]
}
