{
  "type": "law",
  "paragraphs": [
    {
      "id": 1,
      "title": "Categories of Data We Collect",
      "textCondensed": "In the scenario, your personal data is collected. Our company collects and processes the data you give us by registering (such as user name, email address, etc.) as well as the picture of your throat you sent us.\nThis picture of your throat is personal data concerning health. Such data is considered to belong to sensitive personal data, a special category of personal data, as per Art. 9 GDPR. As this category of data is considered high risk for the fundamental rights and freedoms of individuals, special processing rules apply.   \nHence, in this scenario, we collect and process both personal data and sensitive personal data. \nThe fact that the data is transferred to our company after you used our app and after you got the medical prediction is irrelevant. The categories of collected data remain the same.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [1],
      "highlightIT": [1],
      "highlightEconomy": [1],
      "highlightApp": []
    },
    {
      "id": 2,
      "title": "Lawful reasons for Data Processing",
      "textCondensed": "To lawfully process personal data our company has to rely on one of the possible lawful reasons listed in Art. 6 GDPR. Two of those lawful reasons to process data are the obtention of users’ consent or legal obligations. Our company could theoretically rely on those two reasons depending on the situation. However, our company will only rely on consent and therefore make sure to have obtained it from its users before processing personal data. \nFor the processing of sensitive data, specific rules apply. The processing of sensitive personal data is basically forbidden. However, Art. 9 GDPR lists some exceptions where sensitive data can be processed. One of the exceptions, among others, is the user’s consent again. This is the exception our company relies on to process these data. \nHence, to process sensitive personal data companies have to rely on one lawful reason from Art. 6 GDPR as well as on one lawful exception from Art. 9 GDPR. In our case, we rely on users’ consent in both situations.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [],
      "highlightIT": [],
      "highlightEconomy": [],
      "highlightApp": []
    },
    {
      "id": 3,
      "title": "Security of Your Data",
      "textCondensed": "<p>Our company complies with all the principles and rules set by the GDPR to ensure the security of the collected, processed, and stored personal data. <br /> In the context of data security, our company complies with the principles of data minimization (GDPR 5(1)(c), storage limitation (GDPR 5(1)(e) and accountability (GDPR 5(2). <br /> Furthermore, many different tools supporting security are put in place by our company: <br /> &bull; Our company conducted a Data Protection Impact Assessment (DPIA) before starting its processing activities. <br /> &bull; Our company has appointed a Data Protection Officer. <br /> &bull; Our app is built around the concept of privacy by design and by default. <br /> &bull; Our company keeps a record of its processing activities.<br /> &bull; To secure the data itself our company uses secure methods, such as pseudonymization and encryption.&nbsp;</p>",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [3],
      "highlightIT": [2, 4],
      "highlightEconomy": [],
      "highlightApp": []
    },
    {
      "id": 4,
      "title": "Sale of Your Data",
      "textCondensed": "In this scenario, our company does not sell personal data. Hence, our company as no particular legal obligation in this context.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [4],
      "highlightIT": [],
      "highlightEconomy": [2, 3],
      "highlightApp": []
    },
    {
      "id": 5,
      "title": "Your Rights over Your Personal Data",
      "textCondensed": "<p>The GDPR recognizes a series of new rights for individuals whose personal data is collected and processed. This will enable them to have better control over their personal data.<br /> Here is a list of the rights you have in the context of our processing of your data:&nbsp; <br /> &bull; The right to be informed (Art. 12 GDPR) &ndash; you have the right to be informed of what data is processed, for which purpose, and how. <br /> &bull; The right of access (Art. 15 GDPR) &ndash; you can have access to the data we hold about you, free of charge. <br /> &bull; The right to rectification (Art. 16 GDPR) &ndash; You have the right to have your inaccurate personal data rectified or completed. <br /> &bull; The right to erasure or right to be forgotten (Art. 17 GDPR) -You have the right to have your personal data erased.<br /> &bull; The right to restrict processing (Art. 18 GDPR) &ndash; You have the right to require restrictions on the processing of your personal data. <br /> &bull; The right to portability (Art. 20 GDPR) &ndash; You have the right to transfer our data to another service provider. <br /> &bull; The right to object (Art. 21 GDPR) &ndash; You have the right to object to the processing of your personal data.&nbsp;</p>",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [5],
      "highlightIT": [3],
      "highlightEconomy": [4,5],
      "highlightApp": []
    }
  ],
  "references": [
    {
      "name": "GDPR",
      "link": "https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:32016R0679&from=EN"
    }
  ]
}
