{
  "type": "economy",
  "paragraphs": [
    {
      "id": 1,
      "title": "Introduction to Business Model",
      "textCondensed": "In this scenario, the firm collects and sells personalized data. Like this, it is able to personalize the interface of the app and improve the services to the benefit of the user. By selling personalized healthcare data, the company can make a lot of profit. This helps the company to provide the services for 'free', i.e. in exchange for their data, to the users. Since users can register, the data could also be used by the users themselves to pay lower health insurance fees.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [1],
      "highlightIT": [1],
      "highlightEconomy": [1],
      "highlightApp": []
    },
    {
      "id": 2,
      "title": "Advantages from the Firm's Perspective",
      "textCondensed": "For the firm, the following advantages arise from this model. The collected data helps the firm to improve its AI model, its services and marketing capabilities. Further, the personalized data can be used for targeted advertising or applying methods of price or service discrimination. Selling personalized data will enable the firm to earn enough in order to provide the app for 'free'. This will attract more customers who are less concerned about privacy protection. Further, users' switching costs to other apps can be increased by personalising the content presented. Like this, consumer loyalty is easier to establish.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [4],
      "highlightIT": [],
      "highlightEconomy": [2],
      "highlightApp": []
    },
    {
      "id": 3,
      "title": "Disadvantages from the Firm's Perspective",
      "textCondensed": "For the firm, the following disadvantages arise from this model. The firm risks data breaches and liability issues. Therefore, the firm has to invest in data protection and should be informed about GDPR regulations. As far as users are concerned, they might be deterred by the sale of their personalized data. It is hard to gain their confidence which implies higher costs for customer relationship management. There is also a high risk of reputational loss due to misuse of data or data breaches. In addition, a further disadvantage may arise if the sale of the data creates the same advantages from processing the data for competitors as for the firm.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [4],
      "highlightIT": [],
      "highlightEconomy": [3],
      "highlightApp": []
    },
    {
      "id": 4,
      "title": "Advantages from the User's Perspective",
      "textCondensed": "For the user, the following advantages arise from this model. With personalized data being collected, users can profit from the targeted advertisement which reduces searching costs and from possible discounts (e.g. on insurance fees). Further, they can benefit from personalised content and statistics. In exchange for their data, users will be able to access the app for free.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [5],
      "highlightIT": [3],
      "highlightEconomy": [4],
      "highlightApp": []
    },
    {
      "id": 5,
      "title": "Disadvantages from the User's Perspective",
      "textCondensed": "For the user, the following disadvantages arise from this model. Most importantly, users will feel concerned about the loss of privacy. There is an unwanted perception of observation and the users perceive a loss of control over their sensitive data. Further, consumers will have high information costs in terms of privacy protection and sign-up costs when entering the app. Personal costs due to data breaches might arise. Further, as a target of price and service differentiation, they could sacrifice higher costs, also from third parties.  Since the data is personalized, there will be given bargaining power to third parties.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [5],
      "highlightIT": [3],
      "highlightEconomy": [5],
      "highlightApp": []
    }
  ,
    {
      "id": 6,
      "title": "The Social Perspective",
      "textCondensed": "Since personalized data is collected, socially beneficial predictions can be made in detail. Especially in the healthcare sector, these predictions can be very valuable for governments and healthcare institutions. On the other side, the collected data can be used to make individually differentiated predictions about non-users. This is known as 'negative privacy externalities' and affects uninvolved third parties negatively. These externalities cannot be limited by this model.",
      "textFull": "text full",
      "references": [
      ],
      "highlightLaw": [],
      "highlightIT": [],
      "highlightEconomy": [],
      "highlightApp": []
    }
  ],
  "references": [
    {
      "link": "http://google.ch",
      "name": "Link1"
    },
    {
      "link": "http://google.ch",
      "name": "Link2"
    }
  ]
}
